[
    {
        "projectName": "Crypto Search",
        "link": "https://crypto-search-m1va6iduy-davsav16.vercel.app/",
        "github": "https://github.com/davsav16/cryptoSearch",
        "alt": "Screenshot of a Crypto Searching app",
        "tools": "Next.js, React.js, and CSS",
        "description": "Created this small app using Next.js and React.js by following a short youtube tutorial to learn new skills and practice different styles of coding. This app can be used to find and search for a crypto currency."

    },
    {
        "projectName": "Cookie Jar E-Commerce",
        "link": "https://mcdougal-cookies.netlify.app/",
        "github": "https://github.com/davsav16/Ecomerce-butter",
        "alt": "Screenshot of a cookie E-commerce Website",
        "tools": "React, Snipcart, Netlify, ButterCMS, and Chakra-UI",
        "description": "Basic E-commerce app for buying cookies. Using ButterCMS, Snipcart, and Chakra UI. This has the basic layout for a shop with a pull out cart and checkout experience. Please note that you cannot actually buy anything, as the there is no backend set up, but it would be very easy to implement."

    },
    {
        "projectName": "Tech Blog",
        "link": "https://afternoon-castle-80416.herokuapp.com/",
        "github": "https://github.com/davsav16/Tech-Blog-For-Nerds",
        "alt": "Screenshot of multiple posts and comments on a website.",
        "tools": "HandleBars, JavaScript, CSS, JEST, Node, Sequelize, Authentication, Cookies, SQL, RESTful APIS and Crud.",
        "description": "This application allows users to create a profile and then engage in conversation regarding programming news from around the world."

    },
    {
        "projectName": "Deep Thoughts",
        "link": "https://warm-crag-88935.herokuapp.com/",
        "github": "https://github.com/davsav16/deep-thoughts",
        "alt": "Screenshot showing a deep thought about the sky.",
        "tools": "React, JavaScript, CSS, Apollo Client, Heroku, GraphQL, MongoDB, Mutations, and JSON Web Tokens.",
        "description": "This is a website I develop while learning react, where users can add their thoughts, make friends, and react to each others posts."
    },
    {
        "projectName": "Budget Tracker",
        "link": "https://mysterious-basin-87435.herokuapp.com/",
        "github": "https://github.com/davsav16/Budget-Tracker",
        "alt": "Photo of a budget being tracked over time.",
        "tools": "HTML, CSS, JavaScript, IndexedDB, Progressive Web Applications, MongoDB, Mongoose, and Express.",
        "description": "This is a budget app that a traveler could use to keep track of their budget. It will allow for the traveler to add transactions to their budget even when they do not have data/internet."
    },
    {
        "projectName": "Pizza Hut World Wide",
        "link": "https://immense-savannah-08698.herokuapp.com/",
        "github": "https://github.com/davsav16/Pizza-Hut-World-Wide",
        "alt": "Screenshot of a website for pizzas.",
        "tools": "HTML, CSS, JavaScript, IndexedDB, MongoDB, Mongoose, Validation, MongoDB Atlas, and EXpress.",
        "description": "This app was developed for users to post about their favorite pizza and discuss it online."
    },
    {
        "projectName": "Food Festival",
        "link": "https://davsav16.github.io/improved-food-festival/",
        "github": "https://github.com/davsav16/improved-food-festival",
        "alt": "Screenshot showing a website for food lovers to join events.",
        "tools": "HTML, CSS, JavaScript, Webpack, Service Workers, PWA, and Lighthouse.",
        "description": "Created this PWA app during a lesson to create the ability for foodies to gather for events and purchase tickets for the event."
    },
    {
        "projectName": "Events App",
        "link": "https://e-v-e-n-t-s.herokuapp.com/",
        "github": "https://github.com/davsav16/project-events",
        "alt": "Screenshot of a an event creation webpage",
        "tools": "MongoDB, Express, React, Node, CSS, Stripe, DonorBox, and EmailJs",
        "description": "An app to create and keep track of events. Let's get out there and have fun again it is time."
    }
]